org/cs/crypto.org
#+TITLE: Cryptography
#+KEYWORDS: Cryptography
#+OPTIONS: H:3 toc:2 num:3 ^:nil
#+LANGUAGE: en-US
#+AUTHOR: ChrisChen
#+EMAIL: ChrisChen3121@gmail.com
#+SETUPFILE: ../../org-templates/level-1.org
* Secure Sockets Layer/TLS
** Handshake Protocol
   Establish shared secret key using public-key cryptography

** Record Layer
   Transmit data using shared secret key
* Symmetric Encryption
  - k: secret key (e.g. 128bits)
  - E: encryption algorithm
  - D: decryption algorithm
  - m, c: plaintext, ciphertext

  $$E(k, m) = c$$
  $$D(k, c) = m$$

  Both E and D are *public known*
** Single Use Key
** Multi Use Key
* Cipher History
** Substitution Cipher(use substitution table)
   - Caesar Cipher: shift by 3 a->d
   - Large key spaces: 26 letters -> 26!
*** Easy to decipher
    1. Use frequency of English letters. e.g. 'e', 't', 'a'
    2. Use frequency of pairs of letters(digrams). e.g. 'he', 'an', 'th'

** Vigener Cipher(16'th century, Rome)
