docs/cs/crypto.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en-US" xml:lang="en-US">
<head>
<!-- 2021-05-11 Tue 14:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cryptography</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<meta name="keywords" content="Cryptography" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css">
</head>
<body>
<div id="content">
<h1 class="title">Cryptography</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd46039d">1. Secure Sockets Layer/TLS</a>
<ul>
<li><a href="#orgc19f0c2">1.1. Handshake Protocol</a></li>
<li><a href="#org5a70150">1.2. Record Layer</a></li>
</ul>
</li>
<li><a href="#orgc676450">2. Symmetric Encryption</a>
<ul>
<li><a href="#org9cbc6a7">2.1. Single Use Key</a></li>
<li><a href="#orge554cfb">2.2. Multi Use Key</a></li>
</ul>
</li>
<li><a href="#org8835b04">3. Cipher History</a>
<ul>
<li><a href="#org45e0f1f">3.1. Substitution Cipher(use substitution table)</a></li>
<li><a href="#org28ae76a">3.2. Vigener Cipher(16'th century, Rome)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd46039d" class="outline-2">
<h2 id="orgd46039d"><span class="section-number-2">1</span> Secure Sockets Layer/TLS</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc19f0c2" class="outline-3">
<h3 id="orgc19f0c2"><span class="section-number-3">1.1</span> Handshake Protocol</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Establish shared secret key using public-key cryptography
</p>
</div>
</div>

<div id="outline-container-org5a70150" class="outline-3">
<h3 id="org5a70150"><span class="section-number-3">1.2</span> Record Layer</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Transmit data using shared secret key
</p>
</div>
</div>
</div>
<div id="outline-container-orgc676450" class="outline-2">
<h2 id="orgc676450"><span class="section-number-2">2</span> Symmetric Encryption</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>k: secret key (e.g. 128bits)</li>
<li>E: encryption algorithm</li>
<li>D: decryption algorithm</li>
<li>m, c: plaintext, ciphertext</li>
</ul>

<p>
\[E(k, m) = c\]
\[D(k, c) = m\]
</p>

<p>
Both E and D are <b>public known</b>
</p>
</div>
<div id="outline-container-org9cbc6a7" class="outline-3">
<h3 id="org9cbc6a7"><span class="section-number-3">2.1</span> Single Use Key</h3>
</div>
<div id="outline-container-orge554cfb" class="outline-3">
<h3 id="orge554cfb"><span class="section-number-3">2.2</span> Multi Use Key</h3>
</div>
</div>
<div id="outline-container-org8835b04" class="outline-2">
<h2 id="org8835b04"><span class="section-number-2">3</span> Cipher History</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org45e0f1f" class="outline-3">
<h3 id="org45e0f1f"><span class="section-number-3">3.1</span> Substitution Cipher(use substitution table)</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Caesar Cipher: shift by 3 a-&gt;d</li>
<li>Large key spaces: 26 letters -&gt; 26!</li>
</ul>
</div>
<div id="outline-container-org9311c8d" class="outline-4">
<h4 id="org9311c8d"><span class="section-number-4">3.1.1</span> Easy to decipher</h4>
<div class="outline-text-4" id="text-3-1-1">
<ol class="org-ol">
<li>Use frequency of English letters. e.g. 'e', 't', 'a'</li>
<li>Use frequency of pairs of letters(digrams). e.g. 'he', 'an', 'th'</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org28ae76a" class="outline-3">
<h3 id="org28ae76a"><span class="section-number-3">3.2</span> Vigener Cipher(16'th century, Rome)</h3>
</div>
</div>
</div>
</body>
</html>
